app/Controllers/Home.php

    public function daftarberita()
    {
        $model = new \App\Models\BeritaModel();
        $query = $this->db->table('berita');
        $query->select('*');
        $query->where('berita.status', 'Publish');
        $query->like('kategori', 'Berita');
        $query->orlike('kategori', 'Umum');
        $query->orlike('kategori', 'Pengumuman');
        $query->orderBy('tanggal', 'DESC');
        $query->get();

        $data = [
            'berita' => $query->paginate(12, 'berita'),
            'pager' => $query->pager,
            'title' => "Berita | SMA Muhammadiyah Kendari",
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `berita`