app/Controllers/Home.php

SELECT `judul_berita`, `slug_judul`, `gambar`, `ringkasan`
FROM `berita`
WHERE `berita`.`status` = 'Publish'
AND  `kategori` LIKE '%Berita%' ESCAPE '!'
OR  `kategori` LIKE '%Umum%' ESCAPE '!'
OR  `kategori` LIKE '%Pengumuman%' ESCAPE '!'
ORDER BY `prioritas` DESC
 LIMIT 3
SELECT *
FROM `kepsek`
SELECT *
FROM `berita`
WHERE `berita`.`status` = 'Publish'
AND `berita`.`status` = 'Publish'
AND  `kategori` LIKE '%Berita%' ESCAPE '!'
OR  `kategori` LIKE '%Umum%' ESCAPE '!'
OR  `kategori` LIKE '%Pengumuman%' ESCAPE '!'
 LIMIT 12
---
    public function index()
    {
        $data['title'] = "SMA Muhammadiyah Kendari";
        $query = $this->db->table('berita');
        $query->select('judul_berita, slug_judul, gambar, ringkasan');
        $query->where('berita.status', 'Publish');
        $query->like('kategori', 'Berita');
        $query->orlike('kategori', 'Umum');
        $query->orlike('kategori', 'Pengumuman');
        $query->orderBy('prioritas', 'DESC');
        $query->limit(3);
        $hasilQuery = $query->get();
        $data['berita'] = $hasilQuery->getResult();

        $query = $this->db->table('kepsek');
        $query->select('*');
        $hasilQuery = $query->get();
        $data['sambutan'] = $hasilQuery->getResult();

        $query = $this->db->table('berita');
        $query->select('*');
        $query->where('berita.status', 'Publish');
        $query->where('berita.status', 'Publish');
        $query->like('kategori', 'Berita');
        $query->orlike('kategori', 'Umum');
        $query->orlike('kategori', 'Pengumuman');
        $query->limit(12);
        $hasilQuery = $query->get();

SELECT *
FROM `tendik`
---

        $query = $this->db->table('tendik');
        $query->select('*');
        $hasilQuery = $query->get();
        $data['tendik'] = $hasilQuery->getResult();

SELECT *
FROM `berita`
WHERE `berita`.`status` = 'Publish'
AND `slug_judul` = 'transformasi-kualitas-pendidikan-jawab-tantangan-di-era-40'
 LIMIT 1
SELECT *
FROM `berita`
 LIMIT 2, 1
---
    public function berita($id)
    {
        $data['title'] = "Berita | SMA Muhammadiyah Kendari";
        $query = $this->db->table('berita');
        $query->select('*');
        $query->join('users', 'users.id = berita.idUser');
        $query->where('berita.status', 'Publish');
        $query->where('slug_judul', $id);
        $query->limit(1);
        $hasilQuery = $query->get();
        $data['berita'] = $hasilQuery->getResult();

SELECT *
FROM `berita`
WHERE `status` = 'Publish'
AND `kategori` IN ('Berita','Umum')
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `berita`
WHERE `status` = 'Publish'
AND `kategori` IN ('Berita','Umum')
---
    public function daftarberita()
    {
        $model = new \App\Models\BeritaModel();
        $cari = $this->request->getVar('cari');
        if (empty($cari)) {
            $data = [
                'berita' => $model->where('status', 'Publish')
                    ->whereIn('kategori', ['Berita', 'Umum'])
                    ->paginate(12, 'berita'),
                'pager' => $model->pager,
                'title' => "Berita | SMA Muhammadiyah Kendari",
            ];

SELECT *
FROM `pengumuman`
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `pengumuman`
---
    public function daftarpengumuman()
    {
        $model = new \App\Models\PengumumanModel();
        $cari = $this->request->getVar('cari');
        if (empty($cari)) {
            $data = [
                'pengumuman' => $model->paginate(12, 'pengumuman'),
                'pager' => $model->pager,
                'title' => "Pengumuman | SMA Muhammadiyah Kendari",
            ];