app/Controllers/Kesiswaan.php

SELECT *
FROM `siswa`
JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`
---
    public function siswa()
    {
        $data['title'] = "Siswa | Kesiswaan";
        $data['kesiswaan'] = 2;

        $query = $this->db->table('siswa');
        $query->select('*');
        $query->join('kelas', 'kelas.id_kelas = siswa.id_kelas');
        $hasilQuery = $query->get();

SELECT *
FROM `kelas`
---
    public function tambahsiswa()
    {
        $data['title'] = "Tambah Siswa | Kesiswaan";
        $data['kesiswaan'] = 2;

        $query = $this->db->table('kelas');
        $query->select('*');
        $hasilQuery = $query->get();

SELECT *
FROM `siswa`
JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`
WHERE `idSiswa` = '202215'
---
    public function ubahsiswa($id)
    {
        $query = $this->db->table('siswa');
        $query->select('*');
        $query->join('kelas', 'kelas.id_kelas = siswa.id_kelas');
        $query->where('idSiswa', $id);
        $hasilQuery = $query->get();

SELECT *
FROM `kelas`
---

            $query = $this->db->table('kelas');
            $query->select('*');
            $hasilQuery = $query->get();
            $data['kelas'] = $hasilQuery->getResult();