app/Controllers/Keuangan.php

SELECT *
FROM `periode_spp`
---
	public function periodespp()
	{
		$data['title'] = "Periode SPP | Keuangan";
		$data['keuangan'] = 2;

		$query = $this->db->table('periode_spp');
		$query->select('*');
		$hasilQuery = $query->get();

SELECT *
FROM `pembSPP`
---
	public function bayarspp()
	{
		$data['title'] = "Pembayaran SPP | Keuangan";
		$data['keuangan'] = 3;

		$query = $this->db->table('pembSPP');
		$query->select('*');
		$hasilQuery = $query->get();

SELECT `idSiswa` as `id`, `nama` as `text`
FROM `siswa`
 LIMIT 10
---
	public function carisiswa()
	{
		helper(['form', 'url']);
		$data = [];
		$builder = $this->db->table('siswa');
		if (empty($this->request->getVar('q'))) {
			$query = $builder->select('idSiswa as id, nama as text')
				->limit(10)->get();