app/Controllers/Keuangan.php

    public function tambahtransaksi($id)
    {
        $builder = $this->db->table('namaTrx')
            ->select("*")->where('jenisTrx', $id)
            ->get();
---
SELECT *
FROM `namaTrx`
WHERE `jenisTrx` = 'Pengeluaran'