app/Controllers/Tatausaha.php

SELECT *
FROM `guru`
SELECT *
FROM `mapel`
---
    public function guru()
    {
        $data['title'] = "Dashboard | Tata Usaha";
        $data['tatausaha'] = 2;

        $query = $this->db->table('guru');
        $query->select('*');
        $hasilQuery = $query->get();
        $data['guru'] = $hasilQuery->getResult();

        $query = $this->db->table('mapel');
        $query->select('*');
        $hasilQuery = $query->get();

SELECT *
FROM `berkas`
---
    public function berkas()
    {
        $data['title'] = "Berkas | Tatausaha";
        $data['tatausaha'] = 3;

        $query = $this->db->table('berkas');
        $query->select('*');
        $hasilQuery = $query->get();
        $data['berkas'] = $hasilQuery->getResult();

SELECT *
FROM `daftarBerkas`
SELECT *
FROM `berkas`
SELECT *
FROM `guru`
---
    public function berkasguru()
    {
        $data['title'] = "Berkas Guru/Tendik | Tatausaha";
        $data['tatausaha'] = 4;

        $query = $this->db->table('daftarBerkas');
        $query->select('daftarBerkas.fileberkas as fileBerkas,
                        daftarBerkas.idDaftarBerkas as idDaftarBerkas,
                        daftarBerkas.idBerkas as idBerkas,
                        daftarBerkas.id_guru as idGuru,
                        daftarBerkas.tanggal as tgl,
                        guru.nama as namaGuru,
                        berkas.ket as keterangan, berkas.namaBerkas,
                        ');
        $query->join('berkas', 'daftarBerkas.idBerkas = berkas.idBerkas');
        $query->join('guru', 'daftarBerkas.id_guru =guru.id_guru');
        $hasilQuery = $query->get();
        $data['daftarBerkas'] =  $hasilQuery->getResult();

        $query = $this->db->table('berkas');
        $query->select('*');
        $hasilQuery = $query->get();